zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_DMA_TCD.h
#define DMA_TCD_CH18_CSR_EARQ_MASK               (0x2U)
#define DMA_TCD_CH18_CSR_EARQ_SHIFT              (1U)
#define DMA_TCD_CH18_CSR_EARQ_WIDTH              (1U)
#define DMA_TCD_CH18_CSR_EARQ(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_CSR_EARQ_SHIFT)) & DMA_TCD_CH18_CSR_EARQ_MASK)

#define DMA_TCD_CH18_CSR_EEI_MASK                (0x4U)
#define DMA_TCD_CH18_CSR_EEI_SHIFT               (2U)
#define DMA_TCD_CH18_CSR_EEI_WIDTH               (1U)
#define DMA_TCD_CH18_CSR_EEI(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_CSR_EEI_SHIFT)) & DMA_TCD_CH18_CSR_EEI_MASK)

#define DMA_TCD_CH18_CSR_EBW_MASK                (0x8U)
#define DMA_TCD_CH18_CSR_EBW_SHIFT               (3U)
#define DMA_TCD_CH18_CSR_EBW_WIDTH               (1U)
#define DMA_TCD_CH18_CSR_EBW(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_CSR_EBW_SHIFT)) & DMA_TCD_CH18_CSR_EBW_MASK)

#define DMA_TCD_CH18_CSR_DONE_MASK               (0x40000000U)
#define DMA_TCD_CH18_CSR_DONE_SHIFT              (30U)
#define DMA_TCD_CH18_CSR_DONE_WIDTH              (1U)
#define DMA_TCD_CH18_CSR_DONE(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_CSR_DONE_SHIFT)) & DMA_TCD_CH18_CSR_DONE_MASK)

#define DMA_TCD_CH18_CSR_ACTIVE_MASK             (0x80000000U)
#define DMA_TCD_CH18_CSR_ACTIVE_SHIFT            (31U)
#define DMA_TCD_CH18_CSR_ACTIVE_WIDTH            (1U)
#define DMA_TCD_CH18_CSR_ACTIVE(x)               (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_CSR_ACTIVE_SHIFT)) & DMA_TCD_CH18_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH18_ES - Channel Error Status */
/*! @{ */

#define DMA_TCD_CH18_ES_DBE_MASK                 (0x1U)
#define DMA_TCD_CH18_ES_DBE_SHIFT                (0U)
#define DMA_TCD_CH18_ES_DBE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_DBE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_DBE_SHIFT)) & DMA_TCD_CH18_ES_DBE_MASK)

#define DMA_TCD_CH18_ES_SBE_MASK                 (0x2U)
#define DMA_TCD_CH18_ES_SBE_SHIFT                (1U)
#define DMA_TCD_CH18_ES_SBE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_SBE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_SBE_SHIFT)) & DMA_TCD_CH18_ES_SBE_MASK)

#define DMA_TCD_CH18_ES_SGE_MASK                 (0x4U)
#define DMA_TCD_CH18_ES_SGE_SHIFT                (2U)
#define DMA_TCD_CH18_ES_SGE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_SGE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_SGE_SHIFT)) & DMA_TCD_CH18_ES_SGE_MASK)

#define DMA_TCD_CH18_ES_NCE_MASK                 (0x8U)
#define DMA_TCD_CH18_ES_NCE_SHIFT                (3U)
#define DMA_TCD_CH18_ES_NCE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_NCE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_NCE_SHIFT)) & DMA_TCD_CH18_ES_NCE_MASK)

#define DMA_TCD_CH18_ES_DOE_MASK                 (0x10U)
#define DMA_TCD_CH18_ES_DOE_SHIFT                (4U)
#define DMA_TCD_CH18_ES_DOE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_DOE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_DOE_SHIFT)) & DMA_TCD_CH18_ES_DOE_MASK)

#define DMA_TCD_CH18_ES_DAE_MASK                 (0x20U)
#define DMA_TCD_CH18_ES_DAE_SHIFT                (5U)
#define DMA_TCD_CH18_ES_DAE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_DAE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_DAE_SHIFT)) & DMA_TCD_CH18_ES_DAE_MASK)

#define DMA_TCD_CH18_ES_SOE_MASK                 (0x40U)
#define DMA_TCD_CH18_ES_SOE_SHIFT                (6U)
#define DMA_TCD_CH18_ES_SOE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_SOE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_SOE_SHIFT)) & DMA_TCD_CH18_ES_SOE_MASK)

#define DMA_TCD_CH18_ES_SAE_MASK                 (0x80U)
#define DMA_TCD_CH18_ES_SAE_SHIFT                (7U)
#define DMA_TCD_CH18_ES_SAE_WIDTH                (1U)
#define DMA_TCD_CH18_ES_SAE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_SAE_SHIFT)) & DMA_TCD_CH18_ES_SAE_MASK)

#define DMA_TCD_CH18_ES_ERR_MASK                 (0x80000000U)
#define DMA_TCD_CH18_ES_ERR_SHIFT                (31U)
#define DMA_TCD_CH18_ES_ERR_WIDTH                (1U)
#define DMA_TCD_CH18_ES_ERR(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_ES_ERR_SHIFT)) & DMA_TCD_CH18_ES_ERR_MASK)
/*! @} */

/*! @name CH18_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_TCD_CH18_INT_INT_MASK                (0x1U)
#define DMA_TCD_CH18_INT_INT_SHIFT               (0U)
#define DMA_TCD_CH18_INT_INT_WIDTH               (1U)
#define DMA_TCD_CH18_INT_INT(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_INT_INT_SHIFT)) & DMA_TCD_CH18_INT_INT_MASK)
/*! @} */

/*! @name CH18_SBR - Channel System Bus */
/*! @{ */

#define DMA_TCD_CH18_SBR_MID_MASK                (0xFU)
#define DMA_TCD_CH18_SBR_MID_SHIFT               (0U)
#define DMA_TCD_CH18_SBR_MID_WIDTH               (4U)
#define DMA_TCD_CH18_SBR_MID(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_SBR_MID_SHIFT)) & DMA_TCD_CH18_SBR_MID_MASK)

#define DMA_TCD_CH18_SBR_PAL_MASK                (0x8000U)
#define DMA_TCD_CH18_SBR_PAL_SHIFT               (15U)
#define DMA_TCD_CH18_SBR_PAL_WIDTH               (1U)
#define DMA_TCD_CH18_SBR_PAL(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_SBR_PAL_SHIFT)) & DMA_TCD_CH18_SBR_PAL_MASK)

#define DMA_TCD_CH18_SBR_EMI_MASK                (0x10000U)
#define DMA_TCD_CH18_SBR_EMI_SHIFT               (16U)
#define DMA_TCD_CH18_SBR_EMI_WIDTH               (1U)
#define DMA_TCD_CH18_SBR_EMI(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_SBR_EMI_SHIFT)) & DMA_TCD_CH18_SBR_EMI_MASK)

#define DMA_TCD_CH18_SBR_ATTR_MASK               (0xE0000U)
#define DMA_TCD_CH18_SBR_ATTR_SHIFT              (17U)
#define DMA_TCD_CH18_SBR_ATTR_WIDTH              (3U)
#define DMA_TCD_CH18_SBR_ATTR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_SBR_ATTR_SHIFT)) & DMA_TCD_CH18_SBR_ATTR_MASK)
/*! @} */

/*! @name CH18_PRI - Channel Priority */
/*! @{ */

#define DMA_TCD_CH18_PRI_APL_MASK                (0x7U)
#define DMA_TCD_CH18_PRI_APL_SHIFT               (0U)
#define DMA_TCD_CH18_PRI_APL_WIDTH               (3U)
#define DMA_TCD_CH18_PRI_APL(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_PRI_APL_SHIFT)) & DMA_TCD_CH18_PRI_APL_MASK)

#define DMA_TCD_CH18_PRI_DPA_MASK                (0x40000000U)
#define DMA_TCD_CH18_PRI_DPA_SHIFT               (30U)
#define DMA_TCD_CH18_PRI_DPA_WIDTH               (1U)
#define DMA_TCD_CH18_PRI_DPA(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_PRI_DPA_SHIFT)) & DMA_TCD_CH18_PRI_DPA_MASK)

#define DMA_TCD_CH18_PRI_ECP_MASK                (0x80000000U)
#define DMA_TCD_CH18_PRI_ECP_SHIFT               (31U)
#define DMA_TCD_CH18_PRI_ECP_WIDTH               (1U)
#define DMA_TCD_CH18_PRI_ECP(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH18_PRI_ECP_SHIFT)) & DMA_TCD_CH18_PRI_ECP_MASK)
/*! @} */

/*! @name TCD18_SADDR - TCD Source Address */
/*! @{ */

