zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_DMA_TCD.h
#define DMA_TCD_TCD27_CSR_DREQ_MASK              (0x8U)
#define DMA_TCD_TCD27_CSR_DREQ_SHIFT             (3U)
#define DMA_TCD_TCD27_CSR_DREQ_WIDTH             (1U)
#define DMA_TCD_TCD27_CSR_DREQ(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_DREQ_SHIFT)) & DMA_TCD_TCD27_CSR_DREQ_MASK)

#define DMA_TCD_TCD27_CSR_ESG_MASK               (0x10U)
#define DMA_TCD_TCD27_CSR_ESG_SHIFT              (4U)
#define DMA_TCD_TCD27_CSR_ESG_WIDTH              (1U)
#define DMA_TCD_TCD27_CSR_ESG(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_ESG_SHIFT)) & DMA_TCD_TCD27_CSR_ESG_MASK)

#define DMA_TCD_TCD27_CSR_MAJORELINK_MASK        (0x20U)
#define DMA_TCD_TCD27_CSR_MAJORELINK_SHIFT       (5U)
#define DMA_TCD_TCD27_CSR_MAJORELINK_WIDTH       (1U)
#define DMA_TCD_TCD27_CSR_MAJORELINK(x)          (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_MAJORELINK_SHIFT)) & DMA_TCD_TCD27_CSR_MAJORELINK_MASK)

#define DMA_TCD_TCD27_CSR_EEOP_MASK              (0x40U)
#define DMA_TCD_TCD27_CSR_EEOP_SHIFT             (6U)
#define DMA_TCD_TCD27_CSR_EEOP_WIDTH             (1U)
#define DMA_TCD_TCD27_CSR_EEOP(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_EEOP_SHIFT)) & DMA_TCD_TCD27_CSR_EEOP_MASK)

#define DMA_TCD_TCD27_CSR_ESDA_MASK              (0x80U)
#define DMA_TCD_TCD27_CSR_ESDA_SHIFT             (7U)
#define DMA_TCD_TCD27_CSR_ESDA_WIDTH             (1U)
#define DMA_TCD_TCD27_CSR_ESDA(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_ESDA_SHIFT)) & DMA_TCD_TCD27_CSR_ESDA_MASK)

#define DMA_TCD_TCD27_CSR_MAJORLINKCH_MASK       (0x1F00U)
#define DMA_TCD_TCD27_CSR_MAJORLINKCH_SHIFT      (8U)
#define DMA_TCD_TCD27_CSR_MAJORLINKCH_WIDTH      (5U)
#define DMA_TCD_TCD27_CSR_MAJORLINKCH(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD_TCD27_CSR_MAJORLINKCH_MASK)

#define DMA_TCD_TCD27_CSR_BWC_MASK               (0xC000U)
#define DMA_TCD_TCD27_CSR_BWC_SHIFT              (14U)
#define DMA_TCD_TCD27_CSR_BWC_WIDTH              (2U)
#define DMA_TCD_TCD27_CSR_BWC(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_CSR_BWC_SHIFT)) & DMA_TCD_TCD27_CSR_BWC_MASK)
/*! @} */

/*! @name TCD27_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_TCD27_BITER_ELINKNO_BITER_MASK   (0x7FFFU)
#define DMA_TCD_TCD27_BITER_ELINKNO_BITER_SHIFT  (0U)
#define DMA_TCD_TCD27_BITER_ELINKNO_BITER_WIDTH  (15U)
#define DMA_TCD_TCD27_BITER_ELINKNO_BITER(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_BITER_ELINKNO_BITER_SHIFT)) & DMA_TCD_TCD27_BITER_ELINKNO_BITER_MASK)

#define DMA_TCD_TCD27_BITER_ELINKNO_ELINK_MASK   (0x8000U)
#define DMA_TCD_TCD27_BITER_ELINKNO_ELINK_SHIFT  (15U)
#define DMA_TCD_TCD27_BITER_ELINKNO_ELINK_WIDTH  (1U)
#define DMA_TCD_TCD27_BITER_ELINKNO_ELINK(x)     (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_BITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD_TCD27_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD27_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_TCD27_BITER_ELINKYES_BITER_MASK  (0x1FFU)
#define DMA_TCD_TCD27_BITER_ELINKYES_BITER_SHIFT (0U)
#define DMA_TCD_TCD27_BITER_ELINKYES_BITER_WIDTH (9U)
#define DMA_TCD_TCD27_BITER_ELINKYES_BITER(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_BITER_ELINKYES_BITER_SHIFT)) & DMA_TCD_TCD27_BITER_ELINKYES_BITER_MASK)

#define DMA_TCD_TCD27_BITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define DMA_TCD_TCD27_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define DMA_TCD_TCD27_BITER_ELINKYES_LINKCH_WIDTH (5U)
#define DMA_TCD_TCD27_BITER_ELINKYES_LINKCH(x)   (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_TCD27_BITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD_TCD27_BITER_ELINKYES_ELINK_MASK  (0x8000U)
#define DMA_TCD_TCD27_BITER_ELINKYES_ELINK_SHIFT (15U)
#define DMA_TCD_TCD27_BITER_ELINKYES_ELINK_WIDTH (1U)
#define DMA_TCD_TCD27_BITER_ELINKYES_ELINK(x)    (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD27_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_TCD27_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH28_CSR - Channel Control and Status */
/*! @{ */

#define DMA_TCD_CH28_CSR_ERQ_MASK                (0x1U)
#define DMA_TCD_CH28_CSR_ERQ_SHIFT               (0U)
#define DMA_TCD_CH28_CSR_ERQ_WIDTH               (1U)
#define DMA_TCD_CH28_CSR_ERQ(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_ERQ_SHIFT)) & DMA_TCD_CH28_CSR_ERQ_MASK)

#define DMA_TCD_CH28_CSR_EARQ_MASK               (0x2U)
#define DMA_TCD_CH28_CSR_EARQ_SHIFT              (1U)
#define DMA_TCD_CH28_CSR_EARQ_WIDTH              (1U)
#define DMA_TCD_CH28_CSR_EARQ(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_EARQ_SHIFT)) & DMA_TCD_CH28_CSR_EARQ_MASK)

#define DMA_TCD_CH28_CSR_EEI_MASK                (0x4U)
#define DMA_TCD_CH28_CSR_EEI_SHIFT               (2U)
#define DMA_TCD_CH28_CSR_EEI_WIDTH               (1U)
#define DMA_TCD_CH28_CSR_EEI(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_EEI_SHIFT)) & DMA_TCD_CH28_CSR_EEI_MASK)

#define DMA_TCD_CH28_CSR_EBW_MASK                (0x8U)
#define DMA_TCD_CH28_CSR_EBW_SHIFT               (3U)
#define DMA_TCD_CH28_CSR_EBW_WIDTH               (1U)
#define DMA_TCD_CH28_CSR_EBW(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_EBW_SHIFT)) & DMA_TCD_CH28_CSR_EBW_MASK)

#define DMA_TCD_CH28_CSR_DONE_MASK               (0x40000000U)
#define DMA_TCD_CH28_CSR_DONE_SHIFT              (30U)
#define DMA_TCD_CH28_CSR_DONE_WIDTH              (1U)
#define DMA_TCD_CH28_CSR_DONE(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_DONE_SHIFT)) & DMA_TCD_CH28_CSR_DONE_MASK)

#define DMA_TCD_CH28_CSR_ACTIVE_MASK             (0x80000000U)
#define DMA_TCD_CH28_CSR_ACTIVE_SHIFT            (31U)
#define DMA_TCD_CH28_CSR_ACTIVE_WIDTH            (1U)
#define DMA_TCD_CH28_CSR_ACTIVE(x)               (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_CSR_ACTIVE_SHIFT)) & DMA_TCD_CH28_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH28_ES - Channel Error Status */
/*! @{ */

#define DMA_TCD_CH28_ES_DBE_MASK                 (0x1U)
#define DMA_TCD_CH28_ES_DBE_SHIFT                (0U)
#define DMA_TCD_CH28_ES_DBE_WIDTH                (1U)
#define DMA_TCD_CH28_ES_DBE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH28_ES_DBE_SHIFT)) & DMA_TCD_CH28_ES_DBE_MASK)

